loginapi/app/controllers/bookstock_controller.rb

SELECT "bookstocks".* FROM "bookstocks"
---
    def index
        # current_user = User.find_by_id(session[:current_user_id])
        # if (current_user.nil?)
        #     render json: "not authenticated user"
        # else
        # render json: Bookstock.all
        # end
        render json: Bookstock.all

SELECT "bookstocks".* FROM "bookstocks" WHERE "bookstocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        v = Bookstock.find(params[:id])

INSERT INTO "bookstocks" ("bookName", "bookAuthor", "bookQuantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bookName", "Malgudi days"], ["bookAuthor", "R K Narayan"], ["bookQuantity", nil], ["created_at", "2023-01-20 12:39:11.128020"], ["updated_at", "2023-01-20 12:39:11.128020"]]
---
    def create
        # current_user = User.find_by_id(session[:current_user_id])
        # if (current_user.nil?)
        #     render json: "not authenticated user"
        # else

        v = !params[:bookName].empty? and !params[:bookAuthor].empty?

        if (v)
              p=Bookstock.create(
              'bookName': params[:bookName],
              'bookAuthor': params[:bookAuthor],
              'bookQuantity': params[:bookQuantity]
            )

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def update
        current_user = User.find_by_id(session[:current_user_id])

SELECT "bookstocks".* FROM "bookstocks" WHERE "bookstocks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "bookstocks" WHERE "bookstocks"."id" = $1  [["id", 5]]
---
    def destroy
        # current_user = User.find_by_id(session[:current_user_id])
        # if (current_user.nil?)
        #     render json: "not authenticated user"
        # else
        p = Bookstock.find(params[:id])
        p.destroy