loginapi/app/controllers/booksearchbyauthor_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "bookstocks".* FROM "bookstocks" WHERE "bookstocks"."bookAuthor" = $1 LIMIT $2  [["bookAuthor", "KK devi"], ["LIMIT", 1]]
---
    def create
        #Search by book Author,

        # usr = Bookmanage.find_by('bookAuthor': params[:bookAuthor])
        # if (usr.nil?)
        #     render json: "book exist"
        #     # render json: usr
        # else
        #     usr = Bookmanage.find_by('bookName': params[:bookName])
        #     if (usr.nil?)
        #         # render json: "book exist"
        #         render json: usr
        #     else
        #     render json: "book does not exist"

        #     end

        # end
        # bk = Bookmanage.where('bookAuthor': params[:bookAuthor])
        current_user = User.find_by_id(session[:current_user_id])
        if (current_user.nil?)
            render json: "not authenticated user"
        else
        bk = Bookstock.find_by('bookAuthor': params[:bookAuthor])