loginapi/app/controllers/booksearchbyname_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "bookstocks".* FROM "bookstocks" WHERE "bookstocks"."bookName" = $1 LIMIT $2  [["bookName", "Chandamama"], ["LIMIT", 1]]
---
    def create
        current_user = User.find_by_id(session[:current_user_id])
        if (current_user.nil?)
            render json: "not authenticated user"
        else
        bk = Bookstock.find_by('bookName': params[:bookName])