loginapi/app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Hema@gmail.com"], ["LIMIT", 1]]
---
    def create
        usr = User.find_by('email': params[:email])